/**
 * @date August, 2022
 * @author Raikkonen
 * @defgroup AwayFromKeyboard Away from Keyboard
 * @brief
 * The AFK plugin allows you to set yourself as Away from Keyboard.
 * This will notify other players if they try and speak to you, that you are not at your desk.
 *
 * @paragraph cmds Player Commands
 * All commands are prefixed with '/' unless explicitly specified.
 * - afk - Sets your status to Away from Keyboard. Other players will notified if they try to speak to you.
 * - back - Removes the AFK status.
 *
 * @paragraph adminCmds Admin Commands
 * There are no admin commands in this plugin.
 *
 * @paragraph configuration Configuration
 * No configuration file is needed.
 *
 * @paragraph ipc IPC Interfaces Exposed
 * This plugin does not expose any functionality.
 */

#include "PCH.hpp"

#include "Afk.hpp"

#include "Utils/Detour.hpp"

#include "stduuid/uuid.h"

struct VanillaSaveData final
{
        wchar_t accId[40];
        long x050, x054, x058, x05C;
        uint numberOCharacters;
        CHARACTER_ID charFile;                                    // 0x98 / 152 / this+608
        uint shipHash;                                            // 0x99 / 153 / this+612
        float shipHullStatus;                                     // 0x9A / 154 / this+616
        st6::list<Archetype::CollisionGroup*> collisionGroupList; // 0x9B / 155 / this+620
        st6::list<EquipDesc> equipment;                           // 0x9E / 158 / this+632
        int rank;                                                 // 0xA0 / 160 / this+640
        int unk4;                                                 // 0xA1, / 161, / this + 644
        Costume comCostume;                                       // 0xA3 / 162 / this+652
        uint voiceLen;
        char voice[32];          // I hate it
        Costume baseCostume;     // 0xB9 / 185 / this+740
        int rep;                 // 0xB9 / 198 / this+792
        int money;               // 0xC7 / 199 / this+796
        int unknown5[5];         // 0xC8 / 200 / this+800
        int killCount;           // 0xCD / 205 / this+820
        int missionSuccessCount; // 0xCE / 206 / this+824
        int missionFailureCount; // 0xCF / 207 / this+828
        uint unknown6[4];        // 0xD0 / 208 / this+832
        Vector pos;
        Matrix rot;
        uint unknown62; // 0xD0 / 208 / this+832
        char* preFilledWeaponGroupInfo;
        uint unknown63[4];         // 0xD0 / 208 / this+832
        int* SPNeuralNetLogUnk;    // 0xE5 / 229 / this+916
        int interfaceToggleBitmap; // 0xE7 / 231 / this + 924 int unknown7[2]; // 0xD0 / 208 / this+832
        st6::list<void*> visitEntries;
        uint unknown8[13]; // 0xEC / 236 / this+944
        uint systemId;     // 0xF8 / 248 / this+992
        uint unknown9;     // 0xF9 / 249 / this+996
        uint unknown10;    // 0xFA / 250 / this+1000
        uint baseId;       // 0xFB / 251, / this + 1004
        uint lastBaseId;   // 0xFC / 252 / this+1008
        uint baseId3;      // duplicate of previous 2 if docked
        uint baseRoomId;
        uint padding[30];
};

BinarySearchTree<uint> items;
BinarySearchTree<uint>::Node item;

struct VanillaLoadData
{
        uint padding[128];
        st6::wstring name;        // 512
        st6::wstring description; // 528
        uint descripStrId;        // 532
        uint datetimeHigh;
        uint datetimeLow;
        uint shipHash;                             // 544
        uint money;                                // 548
        uint numOfKills;                           // 552
        uint numOfSuccessMissions;                 // 556
        uint numOfFailedMissions;                  // 560
        float hullStatus;                          // 564
        st6::list<EquipDesc> currentEquipAndCargo; // 572
        st6::list<CollisionGroupDesc> currentCollisionGroups;
        float baseHullStatus;                   // 592
        st6::list<EquipDesc> baseEquipAndCargo; // 600
        st6::list<CollisionGroupDesc> baseCollisionGroups;
        uint currentBase;    // 620
        uint lastDockedBase; // 624
        uint currentRoom;    // 628
        uint system;         // 632
        Vector pos;
        Matrix rot;
        uint startingRing;
        uint rank;                                   // 688
        uint unused1;                                // 692
        st6::vector<uint> someBinaryTreeAboutGroups; // SP only
        Costume commCostume;                             // 712
        uint voiceLen;                               // 764
        char voice[32];                              // 768
        Costume baseCostume;                         // 800
        uint tempCargoIdEnumerator;                  // 852
        st6::string prefilledWeaponGroupIni;         // 860
        st6::list<FmtStr> neuralNetLog;              // 872 - probably wrong, 'log' entries from character file. Also 'mostly' SP only.
        uint interfaceState;                         // 884
        uint unused2;                                // 888
        BinarySearchTree<uint> visitLists;           // actually binary search tree
};

struct MPlayerDataSaveStruct
{
        uint padding0[8];
        bool padding8;                           // 32
        bool canDock;                            // 33
        uint can_dock2;                          // 36
        st6::list<uint> DockExceptions;          // 40
        bool can_tl;                             // 52
        uint padding14;                          // 56
        uint TLExceptionStart;                   // 60
        uint TLExceptionEnd;                     // 64
        uint padding17;                          // 68
        BinarySearchTree<uint> BST_killed_ships; // 76
        BinarySearchTree<uint> BST_rm_completed; // 96
        BinarySearchTree<uint> BST_rm_Aborted;   // 116
        BinarySearchTree<uint> BST_rm_Failed;    // 136
        float totalCashEarned;                   // 152
        float totalTimePlayed;                   // 156
        uint padding40;                          // 160
        uint visitedSystemsStart;                // 164
        uint visitedSystemsEnd;                  // 168
        uint padding43;                          // 172
        uint padding44;                          // 176
        uint visitedBasesStart;                  // 180
        uint visitedBasesEnd;                    // 184
        uint padding47;                          // 188
        uint padding48;                          // 192
        uint visitedHolesStart;                  // 196
        uint visitedHolesEnd;                    // 200
        uint padding51;                          // 204
        uint padding52;                          // 208
        uint padding53;                          // 212
        uint padding54;                          // 216
        uint padding55;                          // 220
        uint padding56;                          // 224
        uint padding57;                          // 228
        uint padding58;                          // 232
        uint padding59;                          // 236
        uint vNPCStart;                          // 240
        uint vNPCEnd;                            // 244
        uint padding62;                          // 248
        uint padding63;                          // 252
        uint rumorStart;                         // 256
        uint rumorEnd;                           // 260
        uint padding66;                          // 264
};

namespace Plugins
{
    // writer 6D47120
    // reader 6D47120
    using OnCharacterSave = bool(__fastcall*)(PlayerData* saveData, void* edx, char* file, ushort* timestamp, int timestampStr);
    using OnCharacterLoad = bool(__fastcall*)(void* unk, void* edx, char* filename, VanillaLoadData* data);
    using OnCharacterMPlayerSectionRead = void(__fastcall*)(DWORD* data, void* edx, INI_Reader* reader);
    using OnCharacterMPlayerSectionSave = int*(__fastcall*)(MPlayerDataSaveStruct* mData, void* edx, FILE* stream);

    FunctionDetour saveDetour(OnCharacterSave(DWORD(GetModuleHandleA("server.dll")) + 0x6CCD0));
    FunctionDetour loadDetour(OnCharacterLoad(DWORD(GetModuleHandleA("server.dll")) + 0x67120));
    std::unique_ptr<FunctionDetour<OnCharacterMPlayerSectionRead>> mPlayerReadDetour;
    std::unique_ptr<FunctionDetour<OnCharacterMPlayerSectionSave>> mPlayerSaveDetour;

    // content.dll + 0x12FBBC

