#include "PCH.hpp"

#include "API/FLHook/AccountManager.hpp"

#include "API/FLHook/ClientList.hpp"
#include "API/FLHook/Database.hpp"
#include "API/Utils/Reflection.hpp"

#include <mongocxx/exception/error_code.hpp>
#include <mongocxx/exception/write_exception.hpp>
#include <stduuid/uuid.h>

struct Rumor
{
    uint IDS;
    uint unknown; // number of times read?
};

struct VNpc
{
    enum class NpcMissionStatus
    {
        NotOnAMissionForThisNpc,
        OnAMissionForThisNpc,
        CompletedMissionForThisNpc
    };

    uint baseHash;
    uint npcHash;
    uint interactionCount;
    NpcMissionStatus missionStatus = NpcMissionStatus::NotOnAMissionForThisNpc;
};

struct MPlayerDataSaveStruct
{
        uint padding0[8];
        bool padding8;                           // 32
        bool canDock;                            // 33
        uint can_dock2;                          // 36
        st6::list<uint> DockExceptions;          // 40
        bool can_tl;                             // 52
        uint padding51;                          // 56
        st6::list<uint> TL_Exceptions;           // 60
        BinarySearchTree<uint> BST_killed_ships; // 72
        BinarySearchTree<uint> BST_rm_completed; // 92
        BinarySearchTree<uint> BST_rm_Aborted;   // 112
        BinarySearchTree<uint> BST_rm_Failed;    // 132
        float totalCashEarned;                   // 156
        float totalTimePlayed;                   // 160
        st6::vector<uint> visitedSystems;        // 164
        st6::vector<uint> visitedBases;          // 180
        st6::vector<uint> visitedHoles;          // 196
        uint padding52;                          // 200
        uint padding53;                          // 204
        uint padding54;                          // 208
        uint padding55;                          // 212
        uint padding56;                          // 216
        uint padding57;                          // 220
        uint padding58;                          // 224
        st6::vector<VNpc> visitedNPCs;  // 240
        st6::vector<Rumor> receivedRumors;// 252
};

void ConvertCharacterToVanillaData(VanillaLoadData* data, const Character& character)
{
    std::wstring wCharName = StringUtils::stows(character.characterName);
    data->name = reinterpret_cast<const ushort*>(wCharName.c_str());

    // Play time
    data->datetimeHigh = static_cast<uint>((character.totalTimePlayed & 0xFFFFFFFF00000000LL) >> 32);
    data->datetimeLow = static_cast<uint>(character.totalTimePlayed & 0xFFFFFFFFLL);

    data->shipHash = character.shipHash;
    data->money = character.money;
    data->numOfKills = character.killCount;
    data->numOfSuccessMissions = character.missionSuccessCount;
    data->numOfFailedMissions = character.missionFailureCount;
    data->hullStatus = character.hullStatus;
    data->baseHullStatus = character.baseHullStatus;
    data->currentBase = character.currentBase;
    data->lastDockedBase = character.lastDockedBase;
    data->currentRoom = character.currentRoom;
